brew "direnv"
brew "dnsmasq"
brew "fzf"
brew "gh"
brew "jq"
brew "mas"
brew "openjdk"
brew "powerlevel10k"
brew "tmux"

cask "1password"
cask "acorn"
cask "araxis-merge"
cask "blender"
cask "daisydisk"
cask "figma"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "iterm2"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "mimestream"
cask "parallels"
cask "postman"
cask "rectangle"
cask "sublime-text"
cask "visual-studio-code"
cask "wireshark"
cask "zoom"

mas "Fantastical", id: 975937182
mas "Kindle", id: 405399194
mas "Logic Pro", id: 634148309
mas "Medis", id: 1063631769
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835

vscode "editorconfig.editorconfig"
vscode "monokai.theme-monokai-pro-vscode"
