tap "homebrew/services"

brew "awscli"
brew "direnv"
brew "dnsmasq"
brew "fzf"
brew "gh"
brew "jq"
brew "mas"
brew "openjdk"
brew "powerlevel10k"
brew "python"
brew "redis"
brew "rustup"
brew "aws-sam-cli"
brew "tmux"

cask "1password"
cask "acorn"
cask "adobe-creative-cloud"
cask "araxis-merge"
cask "blender"
cask "claude-code"
cask "daisydisk"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "iterm2"
cask "keybase"
cask "macdown"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "mimestream"
cask "opera"
cask "parallels"
cask "postman"
cask "proxyman"
cask "rectangle"
cask "session-manager-plugin"
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
cask "zoom"

mas "Fantastical", id: 975937182
mas "Kindle", id: 302584613
mas "Logic Pro", id: 634148309
mas "Medis", id: 1063631769
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "Copilot", id: 1447330651 # Budgeting

vscode "editorconfig.editorconfig"
vscode "monokai.theme-monokai-pro-vscode"
cask "wireshark-app"
